"""შექმენით პროგრამა, რომელსაც გადასცემთ სიას, სადაც გექნებათ მთელი რიცხვები. თქვენი დავალებაა,
რომ ამ სიის ორი მინიმალური რიცხვის ჯამი დააბრუნოთ: 
([5, 8, 12, 18, 22]), 13), ([7, 15, 12, 18, 22]), 19), ([25, 42, 12, 18, 22]), 30)"""
#ზრდადობის მიხედვით დალაგებული
def my_func(arr):
    n = len(arr)
    for i in range(n):
        for j in range(0, n-i-1):
            if arr[j] > arr[j+1]:
                arr[j], arr[j+1] = arr[j+1], arr[j]
    result = arr[0] + arr[1]
    return result


print(my_func([5, 8, 12, 18, 22]))  